#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_subnets.tech_subnetes: Reading...
data.aws_subnets.tech_subnetes: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_cluster.tech will be created
  + resource "aws_eks_cluster" "tech" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "tech"
      + platform_version      = (known after apply)
      + role_arn              = "arn:aws:iam::339712924021:role/LabRole"
      + status                = (known after apply)
      + tags_all              = (known after apply)
      + version               = (known after apply)

      + kubernetes_network_config (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-0189dce62ee457be9",
              + "subnet-021f546c83311ddfe",
              + "subnet-033ae403a7c5dc1fe",
              + "subnet-0a8ac5ad40c8b73f9",
              + "subnet-0ca4bdb9f422ed1a7",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.techNode will be created
  + resource "aws_eks_node_group" "techNode" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "tech"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "techNode"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::339712924021:role/LabRole"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0189dce62ee457be9",
          + "subnet-021f546c83311ddfe",
          + "subnet-033ae403a7c5dc1fe",
          + "subnet-0a8ac5ad40c8b73f9",
          + "subnet-0ca4bdb9f422ed1a7",
        ]
      + tags_all               = (known after apply)
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 1
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + endpoint                              = (known after apply)
  + kubeconfig-certificate-authority-data = (known after apply)
  + subnets_output                        = {
      + filter   = [
          + {
              + name   = "availability-zone-id"
              + values = [
                  + "use1-az5",
                  + "use1-az2",
                  + "use1-az1",
                  + "use1-az6",
                  + "use1-az4",
                ]
            },
        ]
      + id       = "us-east-1"
      + ids      = [
          + "subnet-0ca4bdb9f422ed1a7",
          + "subnet-0a8ac5ad40c8b73f9",
          + "subnet-033ae403a7c5dc1fe",
          + "subnet-0189dce62ee457be9",
          + "subnet-021f546c83311ddfe",
        ]
      + tags     = null
      + timeouts = null
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @CarlaCCP, Action: `pull_request`*